Revit 2026 API

# DWFExportOptionsImageFormat Property

---

Controls the compression level of images embedded.

**Namespace:** Autodesk.Revit.DB**Assembly:** RevitAPI (in RevitAPI.dll) Version: 26.0.4.0 (26.0.4.0)

```csharp
public DWFImageFormat ImageFormat { get; set; }
```
```vb
Public Property ImageFormat As DWFImageFormat
	Get
	Set
```
```cpp
public:
property DWFImageFormat ImageFormat {
	DWFImageFormat get ();
	void set (DWFImageFormat value);
}
```
```fsharp
member ImageFormat : DWFImageFormat with get, set
```

#### Property Value

DWFImageFormat

ImageQuality is ignored when ImageFormat is set to "PNG"-the standard format.

#### Reference

DWFExportOptions Class

Autodesk.Revit.DB Namespace